
-- ! env: hadoop 3.1.4 + hive 3.1.3

-- * ==============================================================
-- * data requirement
-- * ==============================================================

-- * desc  :计算每个日期新登录的用户数

-- * input :
-- user_id dt
-- 002 20240901
-- 001 20240901
-- 003 20240901
-- 001 20240902
-- 002 20240902
-- 004 20240903
-- 004 20240904

-- * target: 
-- dt new_cnt
-- 20240901 3
-- 20240902 0
-- 20240903 1
-- 20240904 0

-- * ==============================================================

-- * ==============================================================

-- * create base table
create table base (
    user_id string,
    dt string
);

INSERT INTO base VALUES 
    ('002','20240901'),
    ('001','20240901'),
    ('003','20240901'),
    ('001','20240902'),
    ('002','20240902'),
    ('004','20240903'),
    ('004','20240904')
;

-- * ==============================================================

-- * ==============================================================

-- * solution 1: desc

with first_login_tbl as (
    -- 计算每个用户的首次登录日期
    select 
        user_id,
        min(dt) as first_login_dt
    from base
    group by user_id
)
select 
    dt,
    sum(case when t2.user_id is not null then 1 else 0 end) as cnt
from base t1
left join first_login_tbl t2
    on t1.user_id = t2.user_id
        and t1.dt = t2.first_login_dt   -- 注意需要日期等于首次登录日期
group by dt
;

-- * key points:
-- * desc  :

-- * output:
-- dt      cnt
-- 20240901        3
-- 20240902        0
-- 20240903        1
-- 20240904        0
-- * ==============================================================

